CRT13/ARM/STM32/Resources/STM32VLDiscovery/Recipies/01A.c
/* C-ARM: LED blinking */
#include <stm32f10x.h>
#include <stm32f10x_rcc.h>
#include <stm32f10x_gpio.h>

void Delay(uint32_t nTime);

int main(void){
	GPIO_InitTypeDef GPIO_InitStructure;
	/* Enable peripheral clocks */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
	/* Configure pins */
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(GPIOC,&GPIO_InitStructure);
	/* Configure SysTick timer */
	if (SysTick_Config(SystemCoreClock/1000))
		while(1);
	while(1){
			static int led_state = 0;
			/* Toggle LED */
			GPIO_WriteBit(GPIOC,GPIO_Pin_9,(led_state)? Bit_SET : Bit_RESET);
			led_state = 1-led_state;
			/* Delay: 500ms */
			Delay(500);
		}
}
/* Timer Code */
static __IO uint32_t TimingDelay;
void Delay(uint32_t nTime){
	TimingDelay = nTime;
	while (TimingDelay != 0);
}
void SysTick_Handler(void){
	if (TimingDelay != 0x00)
		TimingDelay--;
}

#ifdef USE_FULL_ASSERT
	void assert_failed(uint8_t* file,uint32_t line){
		while(1);
	}
#endif
